robertinant/emt/src/ti/runtime/wiring/msp432e/variants/MSP_EXP432E401Y/Board_init.c
/*
 * Copyright (c) 2017, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/*
 *  ======== Board_init.c ========
 *  This file is responsible for setting up the board specific items for the
 *  MSP_EXP432E401Y board.
 */
#include <stdint.h>
#include <stdlib.h>

#ifndef __MSP432E401Y__
#define __MSP432E401Y__
#endif

#include <ti/devices/msp432e4/inc/msp432.h>

#include <ti/devices/msp432e4/driverlib/interrupt.h>
#include <ti/devices/msp432e4/driverlib/pwm.h>
#include <ti/devices/msp432e4/driverlib/sysctl.h>
#include <ti/devices/msp432e4/driverlib/udma.h>

#include <ti/devices/msp432e4/driverlib/rom.h>
#include <ti/devices/msp432e4/driverlib/rom_map.h>
#include <ti/devices/msp432e4/driverlib/gpio.h>
#include <ti/devices/msp432e4/driverlib/sysctl.h>

#include <ti/drivers/Power.h>

#include "MSP_EXP432E401Y.h"

/*
 *  =============================== ADC ===============================
 */
#include <ti/drivers/ADC.h>
//#include <ti/drivers/adc/ADCMSP432E4.h>

extern void myADCMSP432E4_close(ADC_Handle);
extern int_fast16_t myADCMSP432E4_convert(ADC_Handle handle, uint16_t *value);
extern void myADCMSP432E4_init(ADC_Handle handle);
extern ADC_Handle myADCMSP432E4_open(ADC_Handle handle, ADC_Params *params);

/* ADC function table for ADCMSP432 implementation */
const ADC_FxnTable myADCMSP432E4_fxnTable = {
    myADCMSP432E4_close,
    NULL, /* ADCMSP432_control, */
    myADCMSP432E4_convert,
    NULL, /* ADCMSP432_convertRawToMicroVolts, */
    myADCMSP432E4_init,
    myADCMSP432E4_open
};

const ADC_Config ADC_config[] = {
    {
        .fxnTablePtr = &myADCMSP432E4_fxnTable,
        .object = (void *)(26), /* 0 */
        .hwAttrs = NULL
    },
    {
        .fxnTablePtr = &myADCMSP432E4_fxnTable,
        .object = (void *)(25), /* 1 */
        .hwAttrs = NULL
    },
    {
        .fxnTablePtr = &myADCMSP432E4_fxnTable,
        .object = (void *)(24), /* 2 */
        .hwAttrs = NULL
    },
    {
        .fxnTablePtr = &myADCMSP432E4_fxnTable,
        .object = (void *)(23), /* 3 */
        .hwAttrs = NULL
    },
    {
        .fxnTablePtr = &myADCMSP432E4_fxnTable,
        .object = (void *)(27), /* 4 */
        .hwAttrs = NULL
    },
    {
        .fxnTablePtr = &myADCMSP432E4_fxnTable,
        .object = (void *)(0), /* 5 */
        .hwAttrs = NULL
    },
    {
        .fxnTablePtr = &myADCMSP432E4_fxnTable,
        .object = (void *)(46), /* 6 */
        .hwAttrs = NULL
    },
    {
        .fxnTablePtr = &myADCMSP432E4_fxnTable,
        .object = (void *)(45), /* 7 */
        .hwAttrs = NULL
    },
    {
        .fxnTablePtr = &myADCMSP432E4_fxnTable,
        .object = (void *)(6),  /* 8 */
        .hwAttrs = NULL
    },
    {
        .fxnTablePtr = &myADCMSP432E4_fxnTable,
        .object = (void *)(2),  /* 9 */
        .hwAttrs = NULL
    },
    {
        .fxnTablePtr = &myADCMSP432E4_fxnTable,
        .object = (void *)(63), /* 10 */
        .hwAttrs = NULL
    },
    {
        .fxnTablePtr = &myADCMSP432E4_fxnTable,
        .object = (void *)(64), /* 11 */
        .hwAttrs = NULL
    },
    {
        .fxnTablePtr = &myADCMSP432E4_fxnTable,
        .object = (void *)(7), /* 12 */
        .hwAttrs = NULL
    },
    {
        .fxnTablePtr = &myADCMSP432E4_fxnTable,
        .object = (void *)(42), /* 13 */
        .hwAttrs = NULL
    },
    {
        .fxnTablePtr = &myADCMSP432E4_fxnTable,
        .object = (void *)(15), /* 14 */
        .hwAttrs = NULL
    },
    {
        .fxnTablePtr = &myADCMSP432E4_fxnTable,
        .object = (void *)(14), /* 15 */
        .hwAttrs = NULL
    },
    {
        .fxnTablePtr = &myADCMSP432E4_fxnTable,
        .object = (void *)(65), /* 16 */
        .hwAttrs = NULL
    },
    {
        .fxnTablePtr = &myADCMSP432E4_fxnTable,
        .object = (void *)(66), /* 17 */
        .hwAttrs = NULL
    },
    {
        .fxnTablePtr = &myADCMSP432E4_fxnTable,
        .object = (void *)(67), /* 18 */
        .hwAttrs = NULL
    },
    {
        .fxnTablePtr = &myADCMSP432E4_fxnTable,
        .object = (void *)(68), /* 19 */
        .hwAttrs = NULL
    },};

const uint_least8_t ADC_count = 20;

/*
 *  ============================= Display =============================
 */
#include <ti/display/Display.h>
#include <ti/display/DisplayUart.h>
#define MAXPRINTLEN 1024

DisplayUart_Object displayUartObject;

static char displayBuf[MAXPRINTLEN];

const DisplayUart_HWAttrs displayUartHWAttrs = {
    .uartIdx = MSP_EXP432E401Y_UART0,
    .baudRate = 115200,
    .mutexTimeout = (unsigned int)(-1),
    .strBuf = displayBuf,
    .strBufLen = MAXPRINTLEN
};

#ifndef BOARD_DISPLAY_USE_UART_ANSI
#define BOARD_DISPLAY_USE_UART_ANSI 0
#endif

const Display_Config Display_config[] = {
    {
#  if (BOARD_DISPLAY_USE_UART_ANSI)
        .fxnTablePtr = &DisplayUartAnsi_fxnTable,
#  else /* Default to minimal UART with no cursor placement */
        .fxnTablePtr = &DisplayUartMin_fxnTable,
#  endif
        .object = &displayUartObject,
        .hwAttrs = &displayUartHWAttrs
    }
};

const uint_least8_t Display_count = sizeof(Display_config) / sizeof(Display_Config);

