robertinant/emt/src/ti/runtime/wiring/msp432e/variants/MSP_EXP432E401Y/Board_init.c
/*
 *  =============================== DMA ===============================
 */
#include <ti/drivers/dma/UDMAMSP432E4.h>

#if defined(__TI_COMPILER_VERSION__)
#pragma DATA_ALIGN(dmaControlTable, 1024)
#elif defined(__IAR_SYSTEMS_ICC__)
#pragma data_alignment=1024
#elif defined(__GNUC__)
__attribute__ ((aligned (1024)))
#endif
static tDMAControlTable dmaControlTable[32];

/*
 *  ======== dmaErrorFxn ========
 *  This is the handler for the uDMA error interrupt.
 */
static void dmaErrorFxn(uintptr_t arg)
{
    int status = uDMAErrorStatusGet();
    uDMAErrorStatusClear();

    /* Suppress unused variable warning */
    (void)status;

    while (1);
}

UDMAMSP432E4_Object udmaMSP432E4Object;

const UDMAMSP432E4_HWAttrs udmaMSP432E4HWAttrs = {
    .controlBaseAddr = (void *)dmaControlTable,
    .dmaErrorFxn = (UDMAMSP432E4_ErrorFxn)dmaErrorFxn,
    .intNum = INT_UDMAERR,
    .intPriority = (~0)
};

const UDMAMSP432E4_Config UDMAMSP432E4_config = {
    .object = &udmaMSP432E4Object,
    .hwAttrs = &udmaMSP432E4HWAttrs
};

/*
 *  =============================== EMAC ===============================
 */
#include <ti/drivers/emac/EMACMSP432E4.h>

/*
 *  Required by the Networking Stack (NDK). This array must be NULL terminated.
 *  This can be removed if NDK is not used.
 *  Double curly braces are needed to avoid GCC bug #944572
 *  https://bugs.launchpad.net/gcc-linaro/+bug/944572
 */
NIMU_DEVICE_TABLE_ENTRY NIMUDeviceTable[2] = {
    {
        /* Default: use Ethernet driver */
        .init = EMACMSP432E4_NIMUInit
    },
    {NULL}
};

/*
 *  EMAC configuration structure
 *  Set user/company specific MAC octates. The following sets the address
 *  to ff-ff-ff-ff-ff-ff. Users need to change this to make the label on
 *  their boards.
 */
unsigned char macAddress[6] = {0xff, 0xff, 0xff, 0xff, 0xff, 0xff};

const EMACMSP432E4_HWAttrs EMACMSP432E4_hwAttrs = {
    .baseAddr = EMAC0_BASE,
    .intNum = INT_EMAC0,
    .intPriority = (~0),
    .led0Pin = EMACMSP432E4_PF0_EN0LED0,
    .led1Pin = EMACMSP432E4_PF4_EN0LED1,
    .macAddress = macAddress
};

/*
 *  =============================== GPIO ===============================
 */
#include <ti/drivers/GPIO.h>
#include <ti/drivers/gpio/GPIOMSP432E4.h>

/*
 * Array of Pin configurations
 * NOTE: The order of the pin configurations must coincide with what was
 *       defined in MSP_EXP432E401Y.h
 * NOTE: Pins not used for interrupts should be placed at the end of the
 *       array.  Callback entries can be omitted from callbacks array to
 *       reduce memory usage.
 */
GPIO_PinConfig gpioPinConfigs[] = {
    /* port_pin */
    GPIOMSP432E4_EMPTY_PIN | GPIO_DO_NOT_CONFIG,    /*  0  - dummy */

    /* pins 1-10 */
    GPIOMSP432E4_EMPTY_PIN | GPIO_DO_NOT_CONFIG,    /*  1  - 3.3V */
    GPIOMSP432E4_PE4 | GPIO_DO_NOT_CONFIG,          /*  2  - PE4 */
    GPIOMSP432E4_PC4 | GPIO_DO_NOT_CONFIG,          /*  3  - PC4 */
    GPIOMSP432E4_PC5 | GPIO_DO_NOT_CONFIG,          /*  4  - PC5 */
    GPIOMSP432E4_PC6 | GPIO_DO_NOT_CONFIG,          /*  5  - PC6 */
    GPIOMSP432E4_PE5 | GPIO_DO_NOT_CONFIG,          /*  6  - PE5 */
    GPIOMSP432E4_PD3 | GPIO_DO_NOT_CONFIG,          /*  7  - PD3 */
    GPIOMSP432E4_PC7 | GPIO_DO_NOT_CONFIG,          /*  8  - PC7 */
    GPIOMSP432E4_PB2 | GPIO_DO_NOT_CONFIG,          /*  9  - PB2 */
    GPIOMSP432E4_PB3 | GPIO_DO_NOT_CONFIG,          /*  10 - PB3 */

    /* pins 11-20 */
    GPIOMSP432E4_PP2 | GPIO_DO_NOT_CONFIG,          /*  11 - PP2 */
    GPIOMSP432E4_PN3 | GPIO_DO_NOT_CONFIG,          /*  12 - PN3 */
    GPIOMSP432E4_PN2 | GPIO_DO_NOT_CONFIG,          /*  13 - PN2 */
    GPIOMSP432E4_PD0 | GPIO_DO_NOT_CONFIG,          /*  14 - PD0 */
    GPIOMSP432E4_PD1 | GPIO_DO_NOT_CONFIG,          /*  15 - PD1 */
    GPIOMSP432E4_EMPTY_PIN | GPIO_DO_NOT_CONFIG,    /*  16 - RESET */
    GPIOMSP432E4_PH3 | GPIO_DO_NOT_CONFIG,          /*  17 - PH3 */
    GPIOMSP432E4_PH2 | GPIO_DO_NOT_CONFIG,          /*  18 - PH2 */
    GPIOMSP432E4_PM3 | GPIO_DO_NOT_CONFIG,          /*  19 - PM3 */
    GPIOMSP432E4_EMPTY_PIN | GPIO_DO_NOT_CONFIG,    /*  20 - GND */

    /* pins 21-30 */
    GPIOMSP432E4_EMPTY_PIN | GPIO_DO_NOT_CONFIG,    /*  21 - 5V */
    GPIOMSP432E4_EMPTY_PIN | GPIO_DO_NOT_CONFIG,    /*  22 - GND */
    GPIOMSP432E4_PE0 | GPIO_DO_NOT_CONFIG,          /*  23 - PE0 */
    GPIOMSP432E4_PE1 | GPIO_DO_NOT_CONFIG,          /*  24 - PE1 */
    GPIOMSP432E4_PE2 | GPIO_DO_NOT_CONFIG,          /*  25 - PE2 */
    GPIOMSP432E4_PE3 | GPIO_DO_NOT_CONFIG,          /*  26 - PE3 */
    GPIOMSP432E4_PD7 | GPIO_DO_NOT_CONFIG,          /*  27 - PD7  NMI */
    GPIOMSP432E4_PA6 | GPIO_DO_NOT_CONFIG,          /*  28 - PA6 */
    GPIOMSP432E4_PM4 | GPIO_DO_NOT_CONFIG,          /*  29 - PM4 */
    GPIOMSP432E4_PM5 | GPIO_DO_NOT_CONFIG,          /*  30 - PM5 */

    /* pins 31-40 */
    GPIOMSP432E4_PL3 | GPIO_DO_NOT_CONFIG,          /*  31 - PL3 */
    GPIOMSP432E4_PL2 | GPIO_DO_NOT_CONFIG,          /*  32 - PL2 */
    GPIOMSP432E4_PL1 | GPIO_DO_NOT_CONFIG,          /*  33 - PL1 */
    GPIOMSP432E4_PL0 | GPIO_DO_NOT_CONFIG,          /*  34 - PL0 */
    GPIOMSP432E4_PL5 | GPIO_DO_NOT_CONFIG,          /*  35 - PL5 */
    GPIOMSP432E4_PL4 | GPIO_DO_NOT_CONFIG,          /*  36 - PL4 */
    GPIOMSP432E4_PG0 | GPIO_DO_NOT_CONFIG,          /*  37 - PG0 */
    GPIOMSP432E4_PF3 | GPIO_DO_NOT_CONFIG,          /*  38 - PF3 */
    GPIOMSP432E4_PF2 | GPIO_DO_NOT_CONFIG,          /*  39 - PF2 */
    GPIOMSP432E4_PF1 | GPIO_DO_NOT_CONFIG,          /*  40 - PF1 */

    /* pins 41-50 */
    GPIOMSP432E4_EMPTY_PIN | GPIO_DO_NOT_CONFIG,    /*  41  - 3.3V */
    GPIOMSP432E4_PD2 | GPIO_DO_NOT_CONFIG,          /*  42 - PD2 */
    GPIOMSP432E4_PP0 | GPIO_DO_NOT_CONFIG,          /*  43 - PP0 */
    GPIOMSP432E4_PP1 | GPIO_DO_NOT_CONFIG,          /*  44 - PP1 */
    GPIOMSP432E4_PD4 | GPIO_DO_NOT_CONFIG,          /*  45 - PD4 */
    GPIOMSP432E4_PD5 | GPIO_DO_NOT_CONFIG,          /*  46 - PD5 */
    GPIOMSP432E4_PQ0 | GPIO_DO_NOT_CONFIG,          /*  47 - PQ0 */
    GPIOMSP432E4_PP4 | GPIO_DO_NOT_CONFIG,          /*  48 - PP4 */
    GPIOMSP432E4_PN5 | GPIO_DO_NOT_CONFIG,          /*  49 - PN5 */
    GPIOMSP432E4_PN4 | GPIO_DO_NOT_CONFIG,          /*  50 - PN4 */

